// Ссылка на менеджер объектов, который создал этот объект, получена
// в предопредленной процедуре "ПриСозданииОбъекта"

Перем _менеджерОбъектов;

//
// Предопределенная процедура, вызывающаяся при создании объекта методом "СоздатьОбъект"
//
// Позволяет разработчику запретить создание обаботки, для чего
// необходимо установить значение параметра "Отказ" в "Истина"
//
// МенеджерЛицензий - ссылка на менеджре лицензий, которым создан объект
// Отказ            - признак запрета создания
// ОписаниеОшибки   - описание ошибки, устанавливаемое разработчиком в случае запрета
// создания объекта
//
// В этой процедуре рекомендуется проверять значения лицензионных
// параметров и в зависимости от них разрешить или запретить создание
// объекта.
//

Процедура ПриСозданииОбъекта(МенеджерОбъектов, Отказ, ОписаниеОшибки) Экспорт
	
	_менеджерОбъектов = МенеджерОбъектов;
	
	Значение = _менеджерОбъектов.ПопыткаПолучитьЗначениеПараметра("pension.f8025a37-05fd-497c-8d29-367ce6cd52c5");
	Отказ = Значение <> "1";
	
КонецПроцедуры

//
// Предопределенная процедура, вызывающаяся при создании объекта методом
// "СоздатьОбъект" перед проверкой лицензии сеанса
//
// Позволяет разработчику отказаться от проверки лицензии, для чего
// необходимо установить значение параметра "Отказ" в "Истина".
//
// Используется в случае когда достаточно только защитить код и данные объекта и
// нет необходимости в контроле лицензий
//
Процедура ПередКонтролемЛицензии(Отказ) Экспорт
	
	// не контролируем количество сеансов -
	// создание объекта не занимает лицензию
	Отказ = Истина;
	
КонецПроцедуры

//
// Предопределенная процедура, вызывающаяся при создании объекта методами
// "Создать" и "СоздатьПоСсылке"
//
Процедура ПриСоздании(МенеджерЛицензий, КлиентскаяСылка, Отказ, ОписаниеОшибки) Экспорт
	
	// Контроль лицензий сеанса выполняется при создании объекта методом
	// "СоздатьОбъект".
	//
	// Чтобы объект было невозможно создать старыми методами без контроля
	// лицензий сеанса запрещаем создание
	
	Отказ = Истина;
	
КонецПроцедуры