//izhtc_translator ИЗМЕНЕННЫЕ СОБЫТИЯ ФОРМЫ (
//Событие ПередЗакрытием() заменилось на ПередЗакрытием(Отказ, СтандартнаяОбработка)
//Событие ПриОткрытии() заменилось на ПриОткрытии(Отказ)
//izhtc_translator ИЗМЕНЕННЫЕ СОБЫТИЯ ФОРМЫ )


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкиВФорме =РеквизитФормыВЗначение("ДеревоНастроек", Тип("ТаблицаЗначений")).Скопировать();

	Элементы.ТабличноеПолеДеревоНастроек.Данные = "НастройкиВФорме";;
	
	// установки оформления колонок
	Элементы.ТабличноеПолеДеревоНастроек.Колонки["Код"].Ширина = 7;
	Элементы.ТабличноеПолеДеревоНастроек.Колонки["Код"].ИзменениеРазмера = ИзменениеРазмераКолонки.НеИзменять;
	
	Элементы.ТабличноеПолеДеревоНастроек.Колонки["ВключатьВОтчет"].Ширина = 9;
	Элементы.ТабличноеПолеДеревоНастроек.Колонки["ВключатьВОтчет"].ИзменениеРазмера = ИзменениеРазмераКолонки.НеИзменять;
	
	Элементы.ТабличноеПолеДеревоНастроек.Колонки["Существенность"].Ширина = 8;
	Элементы.ТабличноеПолеДеревоНастроек.Колонки["Существенность"].ИзменениеРазмера = ИзменениеРазмераКолонки.НеИзменять;
	
	Элементы.ТабличноеПолеДеревоНастроек.Колонки["МаксимальноеКоличество"].Ширина = 6;
	Элементы.ТабличноеПолеДеревоНастроек.Колонки["МаксимальноеКоличество"].ИзменениеРазмера = ИзменениеРазмераКолонки.НеИзменять;
	
	// установки видимости и доступности колонок
	Элементы.ТабличноеПолеДеревоНастроек.Колонки["Наименование"].ТолькоПросмотр = Истина;
	Элементы.ТабличноеПолеДеревоНастроек.Колонки["Код"].ТолькоПросмотр = Истина;
	Элементы.ТабличноеПолеДеревоНастроек.Колонки["ИмяОбластиДопСтроки"].Видимость = Ложь;
	Элементы.ТабличноеПолеДеревоНастроек.Колонки["ТипСостава"].Видимость = Ложь;
	Элементы.ТабличноеПолеДеревоНастроек.Колонки["ЗначениеЭлемента"].Видимость = Ложь;

	Если НЕ ЕстьРасширяемыеСтроки(НастройкиВФорме) Тогда
		Элементы.ТабличноеПолеДеревоНастроек.Колонки["Существенность"].Видимость = Ложь;
		Элементы.ТабличноеПолеДеревоНастроек.Колонки["МаксимальноеКоличество"].Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ТабличноеПолеДеревоНастроек.Колонки["ВключатьВОтчет"].Данные = "";
	Элементы.ТабличноеПолеДеревоНастроек.Колонки["ВключатьВОтчет"].ДанныеФлажка = "ВключатьВОтчет";
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ);
	Элементы.ТабличноеПолеДеревоНастроек.Колонки["ВключатьВОтчет"].РежимРедактирования = РежимРедактированияКолонки.Непосредственно;
	Элементы.ТабличноеПолеДеревоНастроек.Колонки["ВключатьВОтчет"].ГоризонтальноеПоложениеВКолонке = ГоризонтальноеПоложение.Центр;
	
КонецПроцедуры

&НаКлиенте

// izhtc_translator(
// Реализовать функционал через условное оформление формы
Процедура ТабличноеПолеДеревоНастроекПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	// Строки, допускающие определение состава выводятся жирным шрифтом
	Если НЕ ПустаяСтрока(ДанныеСтроки.ТипСостава) Тогда
		ОформлениеСтроки.Ячейки.Наименование.Шрифт = Новый Шрифт(ОформлениеСтроки.Ячейки.Наименование.Шрифт, , , Истина);
	КонецЕсли;
	
	// Для родительских строк отключается возможность ввода значений существенности и максимального количества
	Если ДанныеСтроки.Строки.Количество() > 0 Тогда
		ОформлениеСтроки.Ячейки.Существенность.ТолькоПросмотр = Истина;
		ОформлениеСтроки.Ячейки.Существенность.Видимость = Ложь;
		ОформлениеСтроки.Ячейки.МаксимальноеКоличество.ТолькоПросмотр = Истина;
		ОформлениеСтроки.Ячейки.МаксимальноеКоличество.Видимость = Ложь;
	КонецЕсли;
	
	// Если не указана область доп.строки, то не отображаем флажок включения в отчет
	// в противном случае не отображаем значения существенности и максимального количества для нерасширяемых строк
	Если ПустаяСтрока(ДанныеСтроки.ИмяОбластиДопСтроки) Тогда
		ОформлениеСтроки.Ячейки.ВключатьВОтчет.ТолькоПросмотр = Истина;
		ОформлениеСтроки.Ячейки.ВключатьВОтчет.Видимость = Ложь;
	ИначеЕсли ПустаяСтрока(ДанныеСтроки.ТипСостава) Тогда
		ОформлениеСтроки.Ячейки.Существенность.ТолькоПросмотр = Истина;
		ОформлениеСтроки.Ячейки.Существенность.Видимость = Ложь;
		ОформлениеСтроки.Ячейки.МаксимальноеКоличество.ТолькоПросмотр = Истина;
		ОформлениеСтроки.Ячейки.МаксимальноеКоличество.Видимость = Ложь;
	КонецЕсли;
	
	// Для строк со ссылками на значение не отображаем флажок включения, значения существенности и максимального количества
	Если ЗначениеЗаполнено(ДанныеСтроки.ЗначениеЭлемента) Тогда 
		ОформлениеСтроки.Ячейки.ВключатьВОтчет.ТолькоПросмотр = Истина;
		ОформлениеСтроки.Ячейки.ВключатьВОтчет.Видимость = Ложь;
		ОформлениеСтроки.Ячейки.Существенность.ТолькоПросмотр = Истина;
		ОформлениеСтроки.Ячейки.Существенность.Видимость = Ложь;
		ОформлениеСтроки.Ячейки.МаксимальноеКоличество.ТолькоПросмотр = Истина;
		ОформлениеСтроки.Ячейки.МаксимальноеКоличество.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеДействияФормыСохранить(Команда)
	//izhtc_translator предупреждение
	//В управляемые формы не переносятся кнопки ОК, Записать, Закрыть. Проверить необходимость переноса кода, связанного с текущим элементом!

	
	ЗакрытиеЧерезКнопки = Истина;
	
	Если Модифицированность Тогда
		ЭтаФорма.Закрыть(НастройкиВФорме);
	Иначе
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеДействияФормыОтмена(Команда)
	
	ЗакрытиеЧерезКнопки = Истина;
	
	Если Модифицированность Тогда
		ТекстВопроса = "Состав дополнительных строк был изменен. Сохранить изменения?";
		ОтветПользователя = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		Если ОтветПользователя = КодВозвратаДиалога.Да Тогда
			ЭтаФорма.Закрыть(НастройкиВФорме);
		ИначеЕсли ОтветПользователя = КодВозвратаДиалога.Нет Тогда
			ЭтаФорма.Закрыть();
		Иначе
			// закрывать форму не нужно
		КонецЕсли;
		
	Иначе
		ЭтаФорма.Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЗакрытиеЧерезКнопки И Модифицированность Тогда
		ТекстВопроса = "Состав дополнительных строк был изменен. Сохранить изменения?";
		ОтветПользователя = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		Если ОтветПользователя = КодВозвратаДиалога.Да Тогда
			Отказ = Истина;
			ЭтаФорма.Закрыть(НастройкиВФорме);
		ИначеЕсли ОтветПользователя = КодВозвратаДиалога.Нет Тогда
			// закрываем форму в обычном порядке
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТабличноеПолеДеревоНастроекПередНачаломДобавления_Сервер(УзелРодителя, РезультатВыбора)
		ПозицияРазделителя = Найти(УзелРодителя.ТипСостава, ".");
		ИмяСправочника = Сред(УзелРодителя.ТипСостава, ПозицияРазделителя + 1);
		
		ФормаВыбора = Справочники[ИмяСправочника].ПолучитьФормуВыбора(, ЭтаФорма, );
		
		РезультатВыбора = ФормаВыбора.ОткрытьМодально();
КонецФункции


&НаКлиенте
Процедура ТабличноеПолеДеревоНастроекПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель)
	Перем РезультатВыбора;

	Отказ = Истина;
	
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Родитель.ЗначениеЭлемента) Тогда
		// Можно добавить элемент к родителю верхнего уровня
		УзелРодителя = Родитель.Родитель;
	Иначе
		УзелРодителя = Родитель;
	КонецЕсли;
	
	Если ПустаяСтрока(УзелРодителя.ТипСостава) Тогда
		Возврат;
	КонецЕсли;
	
	Если Найти(УзелРодителя.ТипСостава, "Справочник.") = 1 Тогда
		ТабличноеПолеДеревоНастроекПередНачаломДобавления_Сервер(УзелРодителя, РезультатВыбора);
		
		Если РезультатВыбора <> Неопределено Тогда
			// Выбор групп не предусмотрен в этой версии формы
			Если РезультатВыбора.ЭтоГруппа Тогда
				Сообщить("Выбор групп из справочников не предусмотрен", СтатусСообщения.Внимание);
				Возврат;
			КонецЕсли;
			
			// Проверяем, не дублируется ли значение в ветви дерева
			Если УзелРодителя.Строки.Найти(РезультатВыбора, "ЗначениеЭлемента") <> Неопределено Тогда
				Сообщить("Элемент " + РезультатВыбора.Наименование + " уже включен в состав строки " + УзелРодителя.Наименование + ?(ПустаяСтрока(УзелРодителя.Код), "", " (" + УзелРодителя.Код + ")"), СтатусСообщения.Внимание);
				Возврат;
			КонецЕсли;
			
			НоваяСтрока = УзелРодителя.Строки.Добавить();
			НоваяСтрока.Наименование = РезультатВыбора.Наименование;
			НоваяСтрока.ЗначениеЭлемента = РезультатВыбора;
			
			Элемент.ТекущиеДанные = НоваяСтрока;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеДеревоНастроекПередУдалением(Элемент, Отказ)
	
	Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Родитель) ИЛИ ПустаяСтрока(Элемент.ТекущиеДанные.Родитель.ТипСостава) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияФормыФлажкиУстановить(Команда)
	ПрисвоитьЗначениеФлажкам(НастройкиВФорме, Истина);
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДействияФормыОтметкиСнять(Команда)
	ПрисвоитьЗначениеФлажкам(НастройкиВФорме, Ложь);
	Модифицированность = Истина;
КонецПроцедуры

// <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// izhtc_translator(Функция доступна на клиенте и на сервере. Для оптимизации проверить используемость функции в других функциях и установить соответствующую директиву)
&НаСервере
Процедура ПрисвоитьЗначениеФлажкам(ВетвьДерева, ЗначениеФлажка)

	Для Каждого СтрокаДерева Из ВетвьДерева.Строки Цикл
		СтрокаДерева.ВключатьВОтчет = ЗначениеФлажка;
		Если СтрокаДерева.Строки.Количество() > 0 Тогда
			ПрисвоитьЗначениеФлажкам(СтрокаДерева, ЗначениеФлажка);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ПрисвоитьЗначениеФлажкам()

// <Описание функции>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
// izhtc_translator(Функция доступна на клиенте и на сервере. Для оптимизации проверить используемость функции в других функциях и установить соответствующую директиву)
&НаСервере
Функция ЕстьРасширяемыеСтроки(ВетвьДерева)

	Для Каждого СтрокаДерева Из ВетвьДерева.Строки Цикл
		Если НЕ ПустаяСтрока(СтрокаДерева.ТипСостава) Тогда
			Возврат Истина;
		Иначе
			Если СтрокаДерева.Строки.Количество() > 0 Тогда
				Если ЕстьРасширяемыеСтроки(СтрокаДерева) Тогда
					Возврат Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;

КонецФункции // ЕстьРасширяемыеСтроки()

&НаКлиенте
Процедура ДействияФормыДействиеСправка(Команда)
	ОткрытьСправкуФормы();
КонецПроцедуры

&НаСервере
Функция ДействияФормыСбросить_Сервер()
	Если ДеревоНастроекПоУмолчанию <> Неопределено Тогда
		НастройкиВФорме =РеквизитФормыВЗначение("ДеревоНастроекПоУмолчанию", Тип("ТаблицаЗначений")).Скопировать();
	КонецЕсли;
	Модифицированность = Истина;
КонецФункции


&НаКлиенте
Процедура ДействияФормыСбросить(Команда)
	ДействияФормыСбросить_Сервер();
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////////////////////////
// Операторы инициализации формы

ЗакрытиеЧерезКнопки = Ложь;