
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	Если глВерсияСЛК = Перечисления.уи_ВерсияСЛК.Два Тогда
		Если уи_ЗакрытыеФункцииОсновнаяЦБ.УстановитьРегистрыДокумента() <> Истина Тогда
			Возврат;
		КонецЕсли;
	Иначе
		Если глСистемаЛицензирования.Свойство("Базовая") = Истина Тогда
			Сообщить("У вас базовая версия конфигурации, использование загрузок ограничено!", СтатусСообщения.Важное);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Чтение = Новый ЧтениеXML; 
	Чтение.ОткрытьФайл(ПутьКФайлу); 
	
	ТипТоргов = "";
	ЦБ = "";
	ТипЦБ = "";
	
	Минимальная = 0;
	Максимальная = 0;
	Средневзвешенная = 0;
	Рыночная = 0;
	Рыночная2 = 0;
	Рыночная3 = 0;
	НКД = 0;
	ДатаКотировки = ТекущаяДата();
	
	Пока Чтение.Прочитать() Цикл
		
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			Минимальная = 0;
			Максимальная = 0;
			Средневзвешенная = 0;
			Рыночная = 0;
			Рыночная2 = 0;
			Рыночная3 = 0;
			НКД = 0;
			РегНомер = "";
			ИмяЦБ = "";
			ВидЦБ = Справочники.уи_ОбщиеТипыЦенныхБумаг.ПустаяСсылка();
			
			ИмяУзла = Чтение.Имя;
			
			Пока Чтение.ПрочитатьАтрибут() Цикл 
				
				ТипУзла = Чтение.ТипУзла; 
				Имя = СокрЛП(Чтение.Имя); 
				Значение = СокрЛП(Чтение.Значение);
				
				Если СокрЛП(ИмяУзла) = "SEM21" И СокрЛП(Имя) = "TradeDate" Тогда
					
					ДатаКотировки = ПреобрСтроковойДаты(Значение);
					
				КонецЕсли;	
				
				Если СокрЛП(ИмяУзла) = "BOARD" И СокрЛП(Имя) = "BoardType" Тогда
					ТипТоргов = Значение;	
				КонецЕсли;
				
				Если ИмяУзла = "RECORDS" Тогда
					
					Если ТипТоргов = "MAIN" Тогда
						
						Если ПоискЦБ = 2 Тогда
							
							Если СокрЛП(Имя) = "SecShortName" Тогда
								ЦБ = Справочники.ЦенныеБумаги.НайтиПоНаименованию(СокрЛП(Значение));	
							КонецЕсли;
							
						ИначеЕсли ПоискЦБ = 1 Тогда
							
							Если СокрЛП(Имя) = "SecurityId" Тогда
								ЦБ = Справочники.ЦенныеБумаги.НайтиПоКоду(СокрЛП(Значение));	
							КонецЕсли;
							
						КонецЕсли;
						
						Если СокрЛП(Имя) = "SecurityId" Тогда
							SECID = СокрЛП(Значение);
						КонецЕсли;
						
						Если СокрЛП(Имя) = "RegNumber" Тогда
							РегНомер = СокрЛП(Значение);
							
							Если ЗагрузитьЦБ = Истина Тогда
								
								Если ЦБ = "" Или ЦБ = Справочники.ЦенныеБумаги.ПустаяСсылка() Тогда // ЦБ не найдена, добавим
									
									ОбъектЦБ = Справочники.ЦенныеБумаги.СоздатьЭлемент();
									
									ОбъектЦБ.Родитель = ГруппаЦБ;
									
									ОбъектЦБ.уи_ОбщийТип = ВидЦБ;
									ОбъектЦБ.уи_ГосударственныйРегистрационныйКод = РегНомер;
									ОбъектЦБ.Наименование = ИмяЦБ;
									ОбъектЦБ.уи_ОРЦБ = Истина;
									ОбъектЦБ.уи_ISIN = "";
									ОбъектЦБ.Код = SECID;
									
									Попытка
										ОбъектЦБ.Записать();
									Исключение
									КонецПопытки;
									
									Сообщить("В справочник добавлена новая ЦБ: " + ИмяЦБ, СтатусСообщения.Информация);
									
									ЦБ = ОбъектЦБ.Ссылка;
									
									Если ЦБ.уи_ОбщийТип=Справочники.уи_ОбщиеТипыЦенныхБумаг.АкцииОбыкновенные Или ЦБ.уи_ОбщийТип=Справочники.уи_ОбщиеТипыЦенныхБумаг.АкцииПривилегированные Тогда
										ТипЦБ = "а";
									ИначеЕсли ЦБ.уи_ОбщийТип=Справочники.уи_ОбщиеТипыЦенныхБумаг.КорпоративныеОблигации Или ЦБ.уи_ОбщийТип=Справочники.уи_ОбщиеТипыЦенныхБумаг.ГосударственныеОблигацииСубъктаФедерации 
										Или ЦБ.уи_ОбщийТип=Справочники.уи_ОбщиеТипыЦенныхБумаг.КорпоративныеОблигацииИностр Или ЦБ.уи_ОбщийТип=Справочники.уи_ОбщиеТипыЦенныхБумаг.МуниципальныеОблигации 
										Или ЦБ.уи_ОбщийТип=Справочники.уи_ОбщиеТипыЦенныхБумаг.ФедеральныеГосударственныеОблигации Или ЦБ.уи_ОбщийТип=Справочники.уи_ОбщиеТипыЦенныхБумаг.ОблигацииСИпотечнымПокрытием Тогда  
										ТипЦБ = "об";	  
									КонецЕсли;
									
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЕсли;
						
						Если СокрЛП(Имя) = "SecShortName" Тогда
							ИмяЦБ = СокрЛП(Значение);	
						КонецЕсли;
						
						Если СокрЛП(Имя) = "SecurityType" Тогда
							ТипЦБ = СокрЛП(Значение);
							
							Если СокрЛП(Значение) = "об"  Тогда
								ВидЦБ = Справочники.уи_ОбщиеТипыЦенныхБумаг.КорпоративныеОблигации;	
							ИначеЕсли СокрЛП(Значение) = "ао" Тогда
								ВидЦБ = Справочники.уи_ОбщиеТипыЦенныхБумаг.АкцииОбыкновенные;
							ИначеЕсли СокрЛП(Значение) = "ип" Тогда
								ВидЦБ = Справочники.уи_ОбщиеТипыЦенныхБумаг.ПаиОткрытыхПИФ;	
							КонецЕсли;
						
						КонецЕсли;
												
						Если ЦБ <> Справочники.ЦенныеБумаги.ПустаяСсылка() Тогда
							
							Если СокрЛП(Имя) = "Low" Тогда
								Если ТипЦБ = "об" Тогда
									Номинал = РегистрыСведений.уи_НоминалЦенныхБумаг.ПолучитьПоследнее(ДатаКотировки, Новый Структура("ЦеннаяБумага", ЦБ)).Сумма;
									Если Номинал > 0 Тогда
										Значение = Значение/100*Номинал;
									Иначе
										Значение = Значение*10;
									КонецЕсли;
								КонецЕсли;
								Минимальная = Значение;		
							ИначеЕсли СокрЛП(Имя) = "High" Тогда
								Если ТипЦБ = "об" Тогда
									Номинал = РегистрыСведений.уи_НоминалЦенныхБумаг.ПолучитьПоследнее(ДатаКотировки, Новый Структура("ЦеннаяБумага", ЦБ)).Сумма;
									Если Номинал > 0 Тогда
										Значение = Значение/100*Номинал;
									Иначе
										Значение = Значение*10;
									КонецЕсли;
								КонецЕсли;
								Максимальная = Значение;
							ИначеЕсли СокрЛП(Имя) = "WAPrice" Тогда
								Если ТипЦБ = "об" Тогда
									Номинал = РегистрыСведений.уи_НоминалЦенныхБумаг.ПолучитьПоследнее(ДатаКотировки, Новый Структура("ЦеннаяБумага", ЦБ)).Сумма;
									Если Номинал > 0 Тогда
										Значение = Значение/100*Номинал;
									Иначе
										Значение = Значение*10;
									КонецЕсли;
								КонецЕсли;
								Средневзвешенная = Значение;	
							ИначеЕсли СокрЛП(Имя) = "AccInt" Тогда
								//Если ТипЦБ = "об" Тогда
								//	Номинал = РегистрыСведений.уи_НоминалЦенныхБумаг.ПолучитьПоследнее(ДатаКотировки, Новый Структура("ЦеннаяБумага", ЦБ)).Сумма;
								//	Если Номинал > 0 Тогда
								//		Значение = Значение/100*Номинал;
								//	Иначе
								//		Значение = Значение*10;
								//	КонецЕсли;
								//КонецЕсли;
								Если ТипЦБ = "об" Тогда
									НКД = Значение;	
								КонецЕсли;
							ИначеЕсли СокрЛП(Имя) = "MarketPrice" Тогда
								Если ТипЦБ = "об" Тогда
									Номинал = РегистрыСведений.уи_НоминалЦенныхБумаг.ПолучитьПоследнее(ДатаКотировки, Новый Структура("ЦеннаяБумага", ЦБ)).Сумма;
									Если Номинал > 0 Тогда
										Значение = Значение/100*Номинал;
									Иначе
										Значение = Значение*10;
									КонецЕсли;
								КонецЕсли;
								Рыночная = Значение;	
								//Сообщить(" "+ЦБ + ": " + Рыночная);
							ИначеЕсли СокрЛП(Имя) = "MarketPrice2" Тогда
								Если ТипЦБ = "об" Тогда
									Номинал = РегистрыСведений.уи_НоминалЦенныхБумаг.ПолучитьПоследнее(ДатаКотировки, Новый Структура("ЦеннаяБумага", ЦБ)).Сумма;
									Если Номинал > 0 Тогда
										Значение = Значение/100*Номинал;
									Иначе
										Значение = Значение*10;
									КонецЕсли;
								КонецЕсли;
								Рыночная2 = Значение; 
							ИначеЕсли СокрЛП(Имя) = "MarketPrice3" Тогда
								Если ТипЦБ = "об" Тогда
									Номинал = РегистрыСведений.уи_НоминалЦенныхБумаг.ПолучитьПоследнее(ДатаКотировки, Новый Структура("ЦеннаяБумага", ЦБ)).Сумма;
									Если Номинал > 0 Тогда
										Значение = Значение/100*Номинал;
									Иначе
										Значение = Значение*10;
									КонецЕсли;
								КонецЕсли;
								Рыночная3 = Значение;	
							КонецЕсли;
							
						Иначе // нет ЦБ
							
										
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			
			Если ТипТоргов = "MAIN"  И ЦБ <> Справочники.ЦенныеБумаги.ПустаяСсылка() Тогда 
				
				Если СокрЛП(Чтение.Имя) = "BOARD" Тогда
					
				ИначеЕсли СокрЛП(Чтение.Имя) = "RECORDS" Тогда
					
					// данные по котировкам получены
					
					Для Каждого Стр Из ВидыКотировок Цикл
						
						Если Стр.ВидКотировки.ТипКотировки = Перечисления.уи_ТипыКотировок.min Тогда
							
							Если Стр.Загружать = Истина И Число(Минимальная) > 0 Тогда
								Элемент = РегистрыСведений.уи_КотировкиЦенныхБумаг.СоздатьМенеджерЗаписи();
								Элемент.Период = ДатаКотировки;
								Элемент.Валюта = Справочники.Валюты.НайтиПоКоду("643");
								Элемент.ВидКотировки = Стр.ВидКотировки;
								Элемент.ЗначениеКотировки = Минимальная;
								Элемент.ЦеннаяБумага = ЦБ;
								Элемент.ТорговаяПлощадка = ТорговаяСекция;
								Элемент.Записать();
							КонецЕсли;
							
						ИначеЕсли Стр.ВидКотировки.ТипКотировки = Перечисления.уи_ТипыКотировок.Max Тогда
							
							Если Стр.Загружать = Истина И Число(Максимальная) > 0 Тогда
								Элемент = РегистрыСведений.уи_КотировкиЦенныхБумаг.СоздатьМенеджерЗаписи();
								Элемент.Период = ДатаКотировки;
								Элемент.Валюта = Справочники.Валюты.НайтиПоКоду("643");
								Элемент.ВидКотировки = Стр.ВидКотировки;
								Элемент.ЗначениеКотировки = Максимальная;
								Элемент.ЦеннаяБумага = ЦБ;
								Элемент.ТорговаяПлощадка = ТорговаяСекция;
								Элемент.Записать();
							КонецЕсли;
							
						ИначеЕсли Стр.ВидКотировки.ТипКотировки = Перечисления.уи_ТипыКотировок.average Тогда
							
							Если Стр.Загружать = Истина И Число(Средневзвешенная) > 0 Тогда
								Элемент = РегистрыСведений.уи_КотировкиЦенныхБумаг.СоздатьМенеджерЗаписи();
								Элемент.Период = ДатаКотировки;
								Элемент.Валюта = Справочники.Валюты.НайтиПоКоду("643");
								Элемент.ВидКотировки = Стр.ВидКотировки;
								Элемент.ЗначениеКотировки = Средневзвешенная;
								Элемент.ЦеннаяБумага = ЦБ;
								Элемент.ТорговаяПлощадка = ТорговаяСекция;
								Элемент.Записать();
							КонецЕсли;
							
						ИначеЕсли Стр.ВидКотировки.ТипКотировки = Перечисления.уи_ТипыКотировок.nkd Тогда
							
							Если Стр.Загружать = Истина И Число(НКД) > 0 Тогда
								Элемент = РегистрыСведений.уи_КотировкиЦенныхБумаг.СоздатьМенеджерЗаписи();
								Элемент.Период = ДатаКотировки;
								Элемент.Валюта = Справочники.Валюты.НайтиПоКоду("643");
								Элемент.ВидКотировки = Стр.ВидКотировки;
								Элемент.ЗначениеКотировки = НКД;
								Элемент.ЦеннаяБумага = ЦБ;
								Элемент.ТорговаяПлощадка = ТорговаяСекция;
								Элемент.Записать();
							КонецЕсли;
							
						ИначеЕсли Стр.ВидКотировки.ТипКотировки = Перечисления.уи_ТипыКотировок.market3 Тогда
							
							Если Стр.Загружать = Истина И Число(Рыночная3) > 0 Тогда
								Элемент = РегистрыСведений.уи_КотировкиЦенныхБумаг.СоздатьМенеджерЗаписи();
								Элемент.Период = ДатаКотировки;
								Элемент.Валюта = Справочники.Валюты.НайтиПоКоду("643");
								Элемент.ВидКотировки = Стр.ВидКотировки;
								Элемент.ЗначениеКотировки = Рыночная3;
								Элемент.ЦеннаяБумага = ЦБ;
								Элемент.ТорговаяПлощадка = ТорговаяСекция;
								Элемент.Записать();
							КонецЕсли;
							
						ИначеЕсли Стр.ВидКотировки.ТипКотировки = Перечисления.уи_ТипыКотировок.market Тогда
							
							Если Стр.Загружать = Истина И Число(Рыночная) > 0 Тогда
								Элемент = РегистрыСведений.уи_КотировкиЦенныхБумаг.СоздатьМенеджерЗаписи();
								Элемент.Период = ДатаКотировки;
								Элемент.Валюта = Справочники.Валюты.НайтиПоКоду("643");
								Элемент.ВидКотировки = Стр.ВидКотировки;
								Элемент.ЗначениеКотировки = Рыночная;
								Элемент.ЦеннаяБумага = ЦБ;
								Элемент.ТорговаяПлощадка = ТорговаяСекция;
								Элемент.Записать();
							КонецЕсли;
							
						ИначеЕсли Стр.ВидКотировки.ТипКотировки = Перечисления.уи_ТипыКотировок.market_046ps Тогда
							
							Если Стр.Загружать = Истина И Число(Рыночная2) > 0 Тогда
								Элемент = РегистрыСведений.уи_КотировкиЦенныхБумаг.СоздатьМенеджерЗаписи();
								Элемент.Период = ДатаКотировки;
								Элемент.Валюта = Справочники.Валюты.НайтиПоКоду("643");
								Элемент.ВидКотировки = Стр.ВидКотировки;
								Элемент.ЗначениеКотировки = Рыночная2;
								Элемент.ЦеннаяБумага = ЦБ;
								Элемент.ТорговаяПлощадка = ТорговаяСекция;
								Элемент.Записать();
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	Если ВидыКотировок.Количество() = 0 Тогда
		
		ВыборкаСпр = Справочники.уи_ВидыКотировок.Выбрать();
		
		Пока ВыборкаСпр.Следующий() Цикл
			
			Если ВыборкаСпр.ТипКотировки=Перечисления.уи_ТипыКотировок.average Или ВыборкаСпр.ТипКотировки=Перечисления.уи_ТипыКотировок.market
				 Или ВыборкаСпр.ТипКотировки=Перечисления.уи_ТипыКотировок.Max Или ВыборкаСпр.ТипКотировки=Перечисления.уи_ТипыКотировок.min
				 Или ВыборкаСпр.ТипКотировки=Перечисления.уи_ТипыКотировок.nkd Или ВыборкаСпр.ТипКотировки=Перечисления.уи_ТипыКотировок.market_046ps Или ВыборкаСпр.ТипКотировки=Перечисления.уи_ТипыКотировок.market3 Тогда
				 
				 НоваяСтрока = ВидыКотировок.Добавить();
				 
				 НоваяСтрока.ВидКотировки = ВыборкаСпр.Ссылка;
				 НоваяСтрока.Загружать = Истина;
				 
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПутьКФайлуНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = "Формат XML(*.xml)|*.xml";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла;
		ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ОсновныеДействияФормыВыполнить.Доступность = 1;	
	КонецЕсли;	
	
КонецПроцедуры

Функция ПреобрСтроковойДаты(Значение)
	
	Ст = "";
	Стр = Значение;
	
	Если Найти(Стр, " ") = 0 Тогда
		
		Для Поле = 1 По СтрЧислоВхождений(Стр, "-") + 1 Цикл
			
			Позиция = Найти(Стр, "-");
			
			Если Позиция <> 1 Тогда
				Строка = Сред(Стр, 1, Позиция - 1);
				Ст = Ст + Строка;
			КонецЕсли;
			
			Стр = Сред(Стр, Позиция + 1, СтрДлина(Стр));
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат(Дата(Ст));
	
КонецФункции

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Если глВерсияСЛК = Перечисления.уи_ВерсияСЛК.Два Тогда
		Если уи_ЗакрытыеФункцииОсновнаяЦБ.УстановитьРегистрыДокумента() <> Истина Тогда
			Возврат;
		КонецЕсли;
	Иначе
		Если глСистемаЛицензирования.Свойство("Базовая") = Истина Тогда
			Сообщить("У вас базовая версия конфигурации, использование загрузок ограничено!", СтатусСообщения.Важное);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ТорговаяСекция = ВосстановитьЗначение("ТорговаяСекция2");
	ПутьКФайлу = ВосстановитьЗначение("ПутьКФайлу2");
	
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	СохранитьЗначение("ПутьКФайлу2", ПутьКФайлу);
	СохранитьЗначение("ТорговаяСекция2", ТорговаяСекция);
	
КонецПроцедуры

ПоискЦБ = 2;

