//izhtc_translator ИЗМЕНЕННЫЕ СОБЫТИЯ ФОРМЫ (
//Событие ПриОткрытии() заменилось на ПриОткрытии(Отказ)
//izhtc_translator ИЗМЕНЕННЫЕ СОБЫТИЯ ФОРМЫ )


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Макет = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ОтобразитьТолькоОшибочныеКС = Истина;
	ВывестиРезультатыПроверки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьТолькоОшибочныеКСПриИзменении(Элемент)
	ВывестиРезультатыПроверки();
КонецПроцедуры

// <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// izhtc_translator(Функция доступна на клиенте и на сервере. Для оптимизации проверить используемость функции в других функциях и установить соответствующую директиву)
&НаСервере
Процедура ВывестиРезультатыПроверки()

	// Очищаем имеющееся поле
	Таб = Элементы.ПолеТабличногоДокументаКС;
	Таб.Очистить();
	
	СекцияЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	
	Таб.Вывести(СекцияЗаголовок);
	
	СекцияСтрокаДанных1 = Макет.ПолучитьОбласть("СтрокаДанных1");
	ПорядковыйНомерСтроки = 1;
	
	Для Каждого СтрокаРезультатаПроверки Из РезультатыПроверки Цикл
		// пропускаем положительные проверки если должны отображаться только несоблюденные соотношения
		Если ОтобразитьТолькоОшибочныеКС И СтрокаРезультатаПроверки.РезультатПроверки Тогда
			Продолжить;
		КонецЕсли;
		
		СекцияСтрокаДанных1.Параметры.Номер = ПорядковыйНомерСтроки;
		СекцияСтрокаДанных1.Параметры.ПроверяемоеСоотношение = СтрокаРезультатаПроверки.ПроверяемоеСоотношение;
		
		Если СтрокаРезультатаПроверки.РезультатПроверки Тогда
			СекцияСтрокаДанных1.Параметры.РезультатПроверки = "Соотношение соблюдено";
		Иначе
			СекцияСтрокаДанных1.Параметры.РезультатПроверки = "Соотношение не соблюдено";
		КонецЕсли;
		
		СекцияСтрокаДанных1.Параметры.ОписаниеНарушения = СтрокаРезультатаПроверки.ОписаниеНарушения;
		
		Таб.Вывести(СекцияСтрокаДанных1);
		
		ПорядковыйНомерСтроки = ПорядковыйНомерСтроки + 1;
		
	КонецЦикла;
	
КонецПроцедуры // ВывестиРезультатыПроверки()

&НаКлиенте
Процедура КоманднаяПанель1ПересчитатьОбновить(Команда)
	РезультатыПроверки = ФормаРодитель.ПолучитьРезультатыПроверкиСоотношенияПоказателей();
	ВывестиРезультатыПроверки();
	
КонецПроцедуры
